$(document).ready(()=>{

    const parentId = $('.article-section').data('id');

    const query = {
        model: 0,
        material: 0,
        color: 0,
        glass: false,
    };



    const stats = (()=>{
        const setPhoto = (()=>{
            // const $photo = $('.js-photo');
            // const $mediumPhoto = $photo.children();

            // $photo.view();

            return (photos) => {
                // $photo.attr('href', photos.full);
                // $mediumPhoto.attr('src', photos.medium)
            };
        })();

        const setPrice = (()=>{
            const $priceLabel = $('.js-price');

            /* return (price) => {
                if (+price > 0) {
                    const _price = price.toString();
                    let a = 3;
                    let out = '';
                    for (let i = 0; i < _price.length; ++i) {
                        if (i === a) {
                            out += ' ';
                            a += 3;
                        }
                        out += _price.charAt(_price.length - i - 1);
                    }
                    out = out.split("").reverse().join("");
                    $priceLabel.text(`От ${out} Р`);
                } else
                    $priceLabel.text('Цена договорная');
            };
        })(); */
        return (price) => {
            $priceLabel.text(price);
        };
    })();

        const setColor = (()=>{
            const $priceLabel = $('.js-color');

            return (color) => {
                $priceLabel.text(color);
            };
        })();

        const setMaterial = (()=>{
            const $materialLabel = $('.js-material');

            return (material) => {
                $materialLabel.text(material);
            };
        })();

        const setSku = (()=>{
            const $skuLabel = $('.js-article');

            return (sku) => {
                $skuLabel.text(sku);
            }
        })();

        return {
            setPhoto, setPrice, setSku, setColor, setMaterial
        };
    })();

    const cartQuery = (() => {
        let product = {
            quantity: 1,
            product_id: parentId
        };
        const set = (callback) => {
            product = (typeof callback === 'function') ? callback(product) : callback;
        };
        const get = () => product;
        return {set, get};
    })();




    const placeItems = (() => {
        const $getItem = (info) =>
        `<div 
            data-id="${info.id}"
            data-glass="${JSON.stringify(info.glass)}"  
            data-sku="${info.sku}" 
            data-image="${info.fullImage}" 
            data-thumb="${info.image}" 
            class="model-material__item model-material__item--model js-model-selector"
        >
            <img class="model-material__photo" src="${info.image}">
        </div>`;


        return  (items) => {
            const $items = items.reduce(($items, item) => $items.add($getItem(item)), $());
            selectorsGrid.setModelGrid($items);
        };
    })();

    const handleFetchVariation = (data) => {
        const items = data && data.map(item => {
           return {
               glass: item.glass,
               image: item.image.medium[0],
               fullImage: item.image.full[0],
               price: item.price,
               sku: item.sku,
               id: item.id
           }
        });
        placeItems(items);
    };

    const handleFetchModel = (data) => {
        const _data = data[0];
        const product_id = _data.id;
        cartQuery.set(query => ({...query, product_id}));
        stats.setPrice(_data.price);
        stats.setSku(_data.sku);
    };

    const materialQuery = () =>
        `?${query.material}=${query.color}`;

    const modelQuery = () =>
        `${query.model}?pa_glass=${query.glass}`;

    const onMaterialChange = () => {
        $.ajax(`/wp-json/v1/products/${parentId}/product_variation/` + materialQuery(), {
            method: 'GET'
        }).done(handleFetchVariation);
    };

    const onModelChange = (() => {
        let xhr;
        return (() => {
            if (xhr) xhr.abort();
            xhr = $.ajax(`/wp-json/v1/products/${parentId}/product_variation/` + modelQuery(), {
                method: 'GET'
            }).done(handleFetchModel);
        });
    })();


    //Quantity input
    (()=>{
        const changeHandle = (quantity) => {
            cartQuery.set(query => ({...query, quantity}));
        };
        $('.number-input').numberInput(changeHandle);
    })();


    const  selectors = (() => {


        const material = (()=>{
            const $materialSelectors = $('.js-material-selector');
            const $initSelector = $materialSelectors.filter('.selected');
            query.material = $initSelector.data('material');
            query.color = $initSelector.data('color');
            const selectHandle = (params) => {
                query.material = params.material;
                query.color = params.color;
                stats.setColor(params['color-name']);
                stats.setMaterial(params['material-name']);
                onMaterialChange();
            };
            const selectSelected = ($selector = $materialSelectors) => $selector.filter('.selected').click();
            $materialSelectors.doorSelector(['material', 'color', 'color-name', 'material-name'], selectHandle);
            return {selectSelected};
        })();
        const glass = (()=>{
            const $materialSelectors = $('.js-sub-material-selector');
            const $initSelector = $materialSelectors.filter('.selected:visible');
            query.glass =  ($initSelector.data('glass-name') || false);
            const selectHandle = (params) => {
                query.glass = params.glass || false;
                onModelChange();
            };
            const selectSelected = ($selector = $materialSelectors) => $selector.filter('.selected').click();
            $materialSelectors.doorSelector(['glass-name'], selectHandle);
            return {selectSelected};
        })();
        const model = (()=>{
            const $modelSelectors = $('.js-model-selector');
            const $initSelector = $modelSelectors.filter('.selected');
            const selectHandle = (params) => {
                const glass = params.glass;
                    query.glass = false;
                selectorsGrid.setGlassGrid(glass);
                stats.setPhoto({full: params.image, medium: params.thumb})
                query.model = params.id;
                onModelChange();
            };
            query.model = $initSelector.data('id');
            const setListener = ($selector ) => {
                $selector.doorSelector(['id', 'glass', 'image', 'thumb', 'sku'], selectHandle);
            };
            const selectSelected = ($selector = $modelSelectors) => $selector.filter('.selected').click();
            setListener($modelSelectors);
            return {setListener, selectSelected};
        })();

        return {model, material, glass};
    })();





    const selectorsGrid = (()=>{
        const $selectorsSection = $('.js-selectors');
        const $tabSelectors = $selectorsSection.find('.js-tab-selector');
        const $tabs = $selectorsSection.find('.js-tab');
        const $modelGrid = $selectorsSection.find('.js-grid-model');
        const $materialGrid = $selectorsSection.find('.js-grid-material');
        const $glassGrid = $selectorsSection.find('.js-sub-grid');

        $modelGrid.each(function () {
            $(this).doorPagination(10, 6,2);
        });
        $materialGrid.each(function () {
            $(this).doorPagination(10, 6,4);
        });
        $glassGrid.each(function () {
            $(this).doorPagination(10, 6,4);
        });



        $tabSelectors.click(function() {
            const $this = $(this);
            const index = $tabSelectors.index($this);
            $tabSelectors.removeClass('selected');
            $this.addClass('selected');
            $tabs.removeClass('selected').eq(index).addClass('selected');
        });

        const setModelGrid = ($items) => {
            $modelGrid.each(function () {
                const _items = $items.clone();
                const $this = $(this);
                $this.find('.js-content').html('').append(_items).children().first().click();
                $this.trigger('change');
                selectors.model.setListener(_items);
            });
        };

        const setGlassGrid = (items) => {
            $glassGrid.each(function () {
               const $this = $(this);
               const $items = $this.find('.js-sub-material-selector').hide();
               let _$items;
               if (items.length > 0) {
                   _$items = items.reduce((_ , item) => {
                       const $item = $items.filter(`[data-glass-name="${item}"]`).show();
                       return _.add($item);
                       }, $());
                   _$items.first().click();
               } else {
                   query.glass = false;
               }
               $this.trigger('change');
               if (items.length > 0)
                   $this.show();
               else
                   $this.hide();
            });
        };

        return {setGlassGrid ,setModelGrid};

    })();

    (()=>{
        const $selectorsSection = $('.recommended-items');
        const $tabSelectors = $selectorsSection.find('.js-tab-selector');
        const $tabs = $selectorsSection.find('.js-tab');
        const $grid = $selectorsSection.find('.js-grid');


        $grid.each(function () {
            $(this).doorPagination(3, 2,0);
        });


        $tabSelectors.click(function() {
            const $this = $(this);
            const index = $tabSelectors.index($this);
            $tabSelectors.removeClass('selected');
            $this.addClass('selected');
            $tabs.removeClass('selected').eq(index).addClass('selected');
        });

        $('.recommended-items__item').each(function () {
            const $this = $(this);
            const id = $this.data('id');
            $this.find('.recommended-items__left-button').click(()=>{
                Cart.add({product_id: id, quantity: 1});
            })

        });
    })();




    //Add to cart button animation
    (()=>{
        const $addToCartButton = $('.js-add-to-cart');
        const animationData = {"v":"5.5.0","fr":29.9700012207031,"ip":0,"op":180.00000733155,"w":395,"h":64,"nm":"Композиция 2","ddd":0,"comps":[],"layers":[{"ddd":0,"ind":1,"ty":4,"nm":"Кривые Добавить в корзину","sr":1,"ks":{"o":{"a":0,"k":100,"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":1,"k":[{"i":{"x":0.833,"y":0.833},"o":{"x":0.167,"y":0.167},"t":39,"s":[197,32,0],"to":[-3.667,0,0],"ti":[3.667,0,0]},{"t":44.0000017921567,"s":[175,32,0]}],"ix":2},"a":{"a":0,"k":[99.399,-5.5,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"shapes":[{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[0,0],[0.353,-1.513],[0.813,-1.093],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0],[0,2.16],[-0.353,1.513],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"v":[[15.24,-2.66],[13.66,-2.66],[13.66,-14.24],[3.52,-14.24],[3.52,-12.08],[2.99,-6.57],[1.24,-2.66],[0.16,-2.66],[0.16,3.66],[3.18,3.66],[3.18,0],[12.22,0],[12.22,3.66],[15.24,3.66]],"c":true},"ix":2},"nm":"Д","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0,0],[0,3.56],[0,0],[0,0],[0,0]],"o":[[1.267,-2.307],[0,0],[0,0],[0,0],[0,0]],"v":[[4.72,-2.66],[6.62,-11.46],[6.62,-11.7],[10.54,-11.7],[10.54,-2.66]],"c":true},"ix":2},"nm":"Д","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"Д","np":5,"cix":2,"bm":0,"ix":1,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0.967,1],[1.587,0],[0.987,-1],[0,-1.64],[-0.973,-1],[-1.613,0],[-0.967,1],[0,1.653]],"o":[[-0.967,-1],[-1.613,0],[-0.987,1],[0,1.653],[0.973,1],[1.613,0],[0.967,-1],[0,-1.64]],"v":[[25.55,-9.12],[21.72,-10.62],[17.82,-9.12],[16.34,-5.16],[17.8,-1.18],[21.68,0.32],[25.55,-1.18],[27,-5.16]],"c":true},"ix":2},"nm":"о","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0.433,-0.593],[0.787,0],[0.44,0.587],[0,1.053],[-0.44,0.587],[-0.76,0],[-0.447,-0.58],[0,-1.027]],"o":[[-0.433,0.593],[-0.787,0],[-0.44,-0.587],[0,-1.027],[0.44,-0.587],[0.787,0],[0.447,0.58],[0,1.053]],"v":[[23.51,-2.71],[21.68,-1.82],[19.84,-2.7],[19.18,-5.16],[19.84,-7.58],[21.64,-8.46],[23.49,-7.59],[24.16,-5.18]],"c":true},"ix":2},"nm":"о","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"о","np":5,"cix":2,"bm":0,"ix":2,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0.907,0.973],[1.347,0],[0.673,-0.567],[0.293,-0.813],[0,0],[-2.133,0.2],[-0.36,0.053],[-0.44,0.147],[-0.267,0.207],[-0.213,0.367],[-0.067,0.507],[0,0],[0.313,-0.087],[0.527,-0.053],[0.28,-0.08],[0.533,-0.427],[0.287,-0.493],[0.16,-0.687],[0.047,-0.553],[0,-0.72],[-0.18,-0.72],[-0.373,-0.627],[-0.667,-0.367],[-0.893,0],[-0.967,0.967],[0,1.627]],"o":[[-0.907,-0.973],[-1.08,0],[-0.673,0.567],[0,0],[0.28,-2.547],[0.573,-0.053],[0.36,-0.053],[0.44,-0.147],[0.267,-0.207],[0.213,-0.367],[0,0],[-0.08,0.173],[-0.313,0.087],[-0.527,0.053],[-0.72,0.187],[-0.533,0.427],[-0.287,0.493],[-0.16,0.687],[-0.047,0.553],[0,0.8],[0.18,0.72],[0.373,0.627],[0.667,0.367],[1.653,0],[0.967,-0.967],[0,-1.573]],"v":[[37.82,-8.86],[34.44,-10.32],[31.81,-9.47],[30.36,-7.4],[30.3,-7.4],[33.92,-11.52],[35.32,-11.68],[36.52,-11.98],[37.58,-12.51],[38.3,-13.37],[38.72,-14.68],[36.02,-14.68],[35.43,-14.29],[34.17,-14.08],[32.96,-13.88],[31.08,-12.96],[29.85,-11.58],[29.18,-9.81],[28.87,-7.95],[28.8,-6.04],[29.07,-3.76],[29.9,-1.74],[31.46,-0.25],[33.8,0.3],[37.73,-1.15],[39.18,-5.04]],"c":true},"ix":2},"nm":"б","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0.413,-0.56],[0.733,0],[0.42,0.553],[0,1.027],[-0.42,0.56],[-0.707,0],[-0.42,-0.553],[0,-1]],"o":[[-0.413,0.56],[-0.733,0],[-0.42,-0.553],[0,-1],[0.42,-0.56],[0.747,0],[0.42,0.553],[0,1.027]],"v":[[35.72,-2.68],[34,-1.84],[32.27,-2.67],[31.64,-5.04],[32.27,-7.38],[33.96,-8.22],[35.71,-7.39],[36.34,-5.06]],"c":true},"ix":2},"nm":"б","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"б","np":5,"cix":2,"bm":0,"ix":3,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,1.307],[0,0],[3,0],[0.16,-2.32],[0,0],[-0.307,0.233],[-0.653,0],[0,-0.92],[0.34,-0.147],[1,-0.133],[0.253,-0.047],[0.413,-0.093],[0.233,-0.147],[0.26,-0.227],[0.113,-0.333],[0,-0.44],[-0.653,-0.553],[-1.147,0],[-0.867,0.867],[-0.093,-0.267],[0,0]],"o":[[0,0],[0,-2.24],[-3.027,0],[0,0],[0.093,-0.587],[0.307,-0.233],[1.24,0],[0,0.4],[-0.34,0.147],[-0.453,0.053],[-0.253,0.047],[-0.413,0.093],[-0.233,0.147],[-0.26,0.227],[-0.113,0.333],[0,0.973],[0.653,0.553],[1.36,0],[0.04,0.4],[0,0],[-0.24,-0.56]],"v":[[50.32,-2.8],[50.32,-7.26],[45.82,-10.62],[41.04,-7.14],[43.7,-7.14],[44.3,-8.37],[45.74,-8.72],[47.6,-7.34],[47.09,-6.52],[45.08,-6.1],[44.02,-5.95],[43.02,-5.74],[42.05,-5.38],[41.31,-4.82],[40.75,-3.98],[40.58,-2.82],[41.56,-0.53],[44.26,0.3],[47.6,-1],[47.8,0],[50.68,0]],"c":true},"ix":2},"nm":"а","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0,0],[0.46,-0.407],[0.76,0],[0.273,0.247],[0,0.427],[-0.293,0.253],[-0.84,0.133],[-0.333,0.2]],"o":[[0,0.72],[-0.46,0.407],[-0.493,0],[-0.273,-0.247],[0,-0.44],[0.253,-0.2],[1,-0.16],[0,0]],"v":[[47.58,-3.86],[46.89,-2.17],[45.06,-1.56],[43.91,-1.93],[43.5,-2.94],[43.94,-3.98],[45.58,-4.48],[47.58,-5.02]],"c":true},"ix":2},"nm":"а","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"а","np":5,"cix":2,"bm":0,"ix":4,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[-0.66,0.54],[0,0.973],[1.253,0.36],[0,0.987],[0.613,0.433],[0.973,0],[0,0]],"o":[[0,0],[1.013,0],[0.66,-0.54],[0,-1.32],[0.933,-0.427],[0,-0.867],[-0.613,-0.433],[0,0],[0,0]],"v":[[52.52,0],[58.739,0],[61.249,-0.81],[62.24,-3.08],[60.359,-5.6],[61.759,-7.72],[60.839,-9.67],[58.459,-10.32],[52.52,-10.32]],"c":true},"ix":2},"nm":"в","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[-0.3,-0.16],[0,-0.453],[1.12,0],[0,0]],"o":[[0,0],[0.52,0],[0.3,0.16],[0,0.787],[0,0],[0,0]],"v":[[55.319,-8.52],[57.199,-8.52],[58.429,-8.28],[58.88,-7.36],[57.199,-6.18],[55.319,-6.18]],"c":true},"ix":2},"nm":"в","mn":"ADBE Vector Shape - Group","hd":false},{"ind":2,"ty":"sh","ix":3,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[-0.36,-0.187],[0,-0.547],[0.333,-0.187],[0.587,0],[0,0]],"o":[[0,0],[0.613,0],[0.36,0.187],[0,0.533],[-0.333,0.187],[0,0],[0,0]],"v":[[55.319,-4.58],[57.299,-4.58],[58.759,-4.3],[59.299,-3.2],[58.799,-2.12],[57.419,-1.84],[55.319,-1.84]],"c":true},"ix":2},"nm":"в","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"в","np":6,"cix":2,"bm":0,"ix":5,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"v":[[73.699,-10.32],[70.479,-10.32],[66.799,-3.34],[66.799,-10.32],[64.079,-10.32],[64.079,0],[67.299,0],[70.979,-6.98],[70.979,0],[73.699,0]],"c":true},"ix":2},"nm":"и","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"и","np":3,"cix":2,"bm":0,"ix":6,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"v":[[84.639,-10.32],[75.019,-10.32],[75.019,-8.14],[78.419,-8.14],[78.419,0],[81.239,0],[81.239,-8.14],[84.639,-8.14]],"c":true},"ix":2},"nm":"т","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"т","np":3,"cix":2,"bm":0,"ix":7,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0.713,0.587],[1.093,0],[0,0],[0,0],[0,0],[0,0],[0,0],[-0.713,0.58],[0,1.107]],"o":[[-0.713,-0.587],[0,0],[0,0],[0,0],[0,0],[0,0],[1.173,0],[0.713,-0.58],[0,-1.08]],"v":[[94.089,-5.9],[91.379,-6.78],[88.639,-6.78],[88.639,-10.32],[85.839,-10.32],[85.839,0],[91.259,0],[94.089,-0.87],[95.159,-3.4]],"c":true},"ix":2},"nm":"ь","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0,0],[-0.32,-0.247],[0,-0.48],[1.147,0],[0,0],[0,0]],"o":[[0.52,0],[0.32,0.247],[0,0.96],[0,0],[0,0],[0,0]],"v":[[90.559,-4.86],[91.819,-4.49],[92.299,-3.4],[90.579,-1.96],[88.639,-1.96],[88.639,-4.86]],"c":true},"ix":2},"nm":"ь","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"ь","np":5,"cix":2,"bm":0,"ix":8,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[-0.66,0.54],[0,0.973],[1.253,0.36],[0,0.987],[0.613,0.433],[0.973,0],[0,0]],"o":[[0,0],[1.013,0],[0.66,-0.54],[0,-1.32],[0.933,-0.427],[0,-0.867],[-0.613,-0.433],[0,0],[0,0]],"v":[[102.159,0],[108.379,0],[110.889,-0.81],[111.879,-3.08],[109.999,-5.6],[111.399,-7.72],[110.479,-9.67],[108.099,-10.32],[102.159,-10.32]],"c":true},"ix":2},"nm":"в","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[-0.3,-0.16],[0,-0.453],[1.12,0],[0,0]],"o":[[0,0],[0.52,0],[0.3,0.16],[0,0.787],[0,0],[0,0]],"v":[[104.959,-8.52],[106.839,-8.52],[108.069,-8.28],[108.519,-7.36],[106.839,-6.18],[104.959,-6.18]],"c":true},"ix":2},"nm":"в","mn":"ADBE Vector Shape - Group","hd":false},{"ind":2,"ty":"sh","ix":3,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[-0.36,-0.187],[0,-0.547],[0.333,-0.187],[0.587,0],[0,0]],"o":[[0,0],[0.613,0],[0.36,0.187],[0,0.533],[-0.333,0.187],[0,0],[0,0]],"v":[[104.959,-4.58],[106.939,-4.58],[108.399,-4.3],[108.939,-3.2],[108.439,-2.12],[107.059,-1.84],[104.959,-1.84]],"c":true},"ix":2},"nm":"в","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"в","np":6,"cix":2,"bm":0,"ix":9,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"v":[[125.219,-6.32],[129.219,-10.32],[125.879,-10.32],[122.099,-6.24],[122.099,-10.32],[119.319,-10.32],[119.319,0],[122.099,0],[122.099,-3.16],[123.359,-4.44],[126.339,0],[129.779,0]],"c":true},"ix":2},"nm":"к","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"к","np":3,"cix":2,"bm":0,"ix":10,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0.967,1],[1.587,0],[0.987,-1],[0,-1.64],[-0.973,-1],[-1.613,0],[-0.967,1],[0,1.653]],"o":[[-0.967,-1],[-1.613,0],[-0.987,1],[0,1.653],[0.973,1],[1.613,0],[0.967,-1],[0,-1.64]],"v":[[139.269,-9.12],[135.439,-10.62],[131.539,-9.12],[130.059,-5.16],[131.519,-1.18],[135.399,0.32],[139.269,-1.18],[140.719,-5.16]],"c":true},"ix":2},"nm":"о","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0.433,-0.593],[0.787,0],[0.44,0.587],[0,1.053],[-0.44,0.587],[-0.76,0],[-0.447,-0.58],[0,-1.027]],"o":[[-0.433,0.593],[-0.787,0],[-0.44,-0.587],[0,-1.027],[0.44,-0.587],[0.787,0],[0.447,0.58],[0,1.053]],"v":[[137.229,-2.71],[135.399,-1.82],[133.559,-2.7],[132.899,-5.16],[133.559,-7.58],[135.359,-8.46],[137.209,-7.59],[137.879,-5.18]],"c":true},"ix":2},"nm":"о","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"о","np":5,"cix":2,"bm":0,"ix":11,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[-1.387,0],[-0.82,0.98],[0,1.613],[0.84,1],[1.387,0],[0.747,-1.04],[0,0]],"o":[[0,0],[0,0],[0,0],[0.733,1.027],[1.347,0],[0.82,-0.98],[0,-1.667],[-0.84,-1],[-1.387,0],[0,0],[0,0]],"v":[[142.578,-10.32],[142.578,3.66],[145.398,3.66],[145.398,-1.28],[148.578,0.26],[151.828,-1.21],[153.058,-5.1],[151.798,-9.1],[148.458,-10.6],[145.258,-9.04],[145.258,-10.32]],"c":true},"ix":2},"nm":"р","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[-0.44,-0.573],[0,-1],[0.433,-0.56],[0.76,0],[0.44,0.56],[0,1],[-0.433,0.56],[-0.773,0]],"o":[[0.44,0.573],[0,0.973],[-0.433,0.56],[-0.773,0],[-0.44,-0.56],[0,-1],[0.433,-0.56],[0.76,0]],"v":[[149.558,-7.46],[150.218,-5.1],[149.568,-2.8],[147.778,-1.96],[145.958,-2.8],[145.298,-5.14],[145.948,-7.48],[147.758,-8.32]],"c":true},"ix":2},"nm":"р","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"mm","mm":1,"nm":"Объединить контуры 1","mn":"ADBE Vector Filter - Merge","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"р","np":5,"cix":2,"bm":0,"ix":12,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0.427,0.373],[0.613,0.08],[0,0],[-0.387,0.44],[0,0.56],[2.88,0],[0.88,-0.54],[0.04,-1.12],[0,0],[-0.313,0.213],[-0.6,0],[-0.28,-0.22],[0,-0.333],[0.333,-0.2],[0.64,0],[0,0],[0,0],[0,0],[0,-0.96],[0.307,-0.253],[0.613,0],[0.107,1.147],[0,0],[-0.907,-0.6],[-1.4,0],[-0.867,0.573],[0,1.093]],"o":[[-0.427,-0.373],[0,0],[0.467,-0.08],[0.387,-0.44],[0,-1.853],[-1.307,0],[-0.88,0.54],[0,0],[0.08,-0.52],[0.313,-0.213],[0.52,0],[0.28,0.22],[0,0.493],[-0.333,0.2],[0,0],[0,0],[0,0],[1.187,0],[0,0.413],[-0.307,0.253],[-1.36,0],[0,0],[0.013,1.24],[0.907,0.6],[1.48,0],[0.867,-0.573],[0,-0.813]],"v":[[163.178,-4.84],[161.618,-5.52],[161.618,-5.56],[162.898,-6.34],[163.478,-7.84],[159.158,-10.62],[155.878,-9.81],[154.498,-7.32],[157.138,-7.32],[157.728,-8.42],[159.098,-8.74],[160.298,-8.41],[160.718,-7.58],[160.218,-6.54],[158.758,-6.24],[158.018,-6.24],[158.018,-4.46],[159.118,-4.46],[160.898,-3.02],[160.438,-2.02],[159.058,-1.64],[156.858,-3.36],[154.158,-3.36],[155.538,-0.6],[158.998,0.3],[162.518,-0.56],[163.818,-3.06]],"c":true},"ix":2},"nm":"з","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"з","np":3,"cix":2,"bm":0,"ix":13,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"v":[[175.198,-10.32],[171.978,-10.32],[168.298,-3.34],[168.298,-10.32],[165.578,-10.32],[165.578,0],[168.798,0],[172.478,-6.98],[172.478,0],[175.198,0]],"c":true},"ix":2},"nm":"и","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"и","np":3,"cix":2,"bm":0,"ix":14,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0]],"v":[[187.058,-10.32],[184.238,-10.32],[184.238,-6.58],[180.258,-6.58],[180.258,-10.32],[177.438,-10.32],[177.438,0],[180.258,0],[180.258,-4.34],[184.238,-4.34],[184.238,0],[187.058,0]],"c":true},"ix":2},"nm":"н","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"н","np":3,"cix":2,"bm":0,"ix":15,"mn":"ADBE Vector Group","hd":false},{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0],[0,0],[0,-0.107],[0.247,-0.24],[0.467,0],[0,0],[0,0],[-0.347,0],[-0.327,0.067],[-0.26,0.187],[-0.153,0.147],[-0.18,0.373],[-0.087,0.207],[-0.187,0.52],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0],[0.053,0.16],[0,0.44],[-0.247,0.24],[0,0],[0,0],[0.92,0.013],[0.427,0],[0.327,-0.067],[0.26,-0.187],[0.153,-0.147],[0.18,-0.373],[0.087,-0.207],[0,0],[0,0]],"v":[[195.697,-10.32],[193.417,-3.3],[191.057,-10.32],[187.997,-10.32],[191.737,-0.46],[191.817,-0.06],[191.447,0.96],[190.377,1.32],[188.997,1.32],[188.997,3.66],[190.897,3.68],[192.027,3.58],[192.907,3.2],[193.527,2.7],[194.027,1.92],[194.427,1.05],[194.837,-0.04],[198.637,-10.32]],"c":true},"ix":2},"nm":"у","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"у","np":3,"cix":2,"bm":0,"ix":16,"mn":"ADBE Vector Group","hd":false}],"ip":0,"op":180.00000733155,"st":0,"bm":0},{"ddd":0,"ind":2,"ty":4,"nm":"Слой-фигура 4","sr":1,"ks":{"o":{"a":0,"k":100,"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[197.5,32,0],"ix":2},"a":{"a":0,"k":[0,0,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"shapes":[{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0]],"v":[[97.188,-2.813],[103.375,3.875],[113.625,-6.625]],"c":false},"ix":2},"nm":"Контур 1","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"tm","s":{"a":0,"k":0,"ix":1},"e":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":138,"s":[0]},{"t":154.000006272549,"s":[100]}],"ix":2},"o":{"a":0,"k":0,"ix":3},"m":1,"ix":2,"nm":"Обрезать контуры 1","mn":"ADBE Vector Filter - Trim","hd":false},{"ty":"st","c":{"a":0,"k":[0.203921568627,0.203921568627,0.203921568627,1],"ix":3},"o":{"a":0,"k":100,"ix":4},"w":{"a":0,"k":2,"ix":5},"lc":1,"lj":1,"ml":4,"bm":0,"nm":"Обводка 1","mn":"ADBE Vector Graphic - Stroke","hd":false},{"ty":"tr","p":{"a":0,"k":[0,0],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"Фигура 1","np":4,"cix":2,"bm":0,"ix":1,"mn":"ADBE Vector Group","hd":false}],"ip":0,"op":180.00000733155,"st":0,"bm":0},{"ddd":0,"ind":3,"ty":4,"nm":"Слой-фигура 3","sr":1,"ks":{"o":{"a":0,"k":100,"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[197.5,32,0],"ix":2},"a":{"a":0,"k":[0,0,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"shapes":[],"ip":0,"op":180.00000733155,"st":0,"bm":0},{"ddd":0,"ind":4,"ty":4,"nm":"Слой-фигура 2","sr":1,"ks":{"o":{"a":0,"k":100,"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[302,31.864,0],"ix":2},"a":{"a":0,"k":[94,-10.75,0],"ix":1},"s":{"a":0,"k":[120.768,120.768,100],"ix":6}},"ao":0,"shapes":[{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[5.799,0],[0,-5.799],[-5.799,0],[0,5.799]],"o":[[-5.799,0],[0,5.799],[5.799,0],[0,-5.799]],"v":[[0,-10.5],[-10.5,0],[0,10.5],[10.5,0]],"c":true},"ix":2},"nm":"Контур 1","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"st","c":{"a":0,"k":[0.203921568627,0.203921568627,0.203921568627,1],"ix":3},"o":{"a":0,"k":100,"ix":4},"w":{"a":0,"k":1.5,"ix":5},"lc":1,"lj":1,"ml":4,"bm":0,"nm":"Обводка 1","mn":"ADBE Vector Graphic - Stroke","hd":false},{"ty":"tr","p":{"a":0,"k":[94,-10.75],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[126.111,126.111],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"Эллипс 1","np":3,"cix":2,"bm":0,"ix":1,"mn":"ADBE Vector Group","hd":false},{"ty":"tm","s":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":90,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":115.334,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":116.666,"s":[4]},{"t":138.000005620855,"s":[100]}],"ix":1},"e":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":90,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":116.666,"s":[100]},{"t":138.000005620855,"s":[100]}],"ix":2},"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":90,"s":[-94]},{"t":138.000005620855,"s":[421.592]}],"ix":3},"m":1,"ix":2,"nm":"Обрезать контуры 1","mn":"ADBE Vector Filter - Trim","hd":false}],"ip":0,"op":180.00000733155,"st":0,"bm":0},{"ddd":0,"ind":5,"ty":4,"nm":"Кривые Arrow 5","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":39,"s":[0]},{"t":44.0000017921567,"s":[100]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[302,32,0],"ix":2},"a":{"a":0,"k":[18,7.5,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"hasMask":true,"masksProperties":[{"inv":false,"mode":"a","pt":{"a":1,"k":[{"i":{"x":0.833,"y":0.833},"o":{"x":0.167,"y":0.167},"t":80,"s":[{"i":[[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0]],"v":[[0,0],[0,14.728],[36,14.728],[36,0]],"c":true}]},{"t":90.0000036657751,"s":[{"i":[[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0]],"v":[[37.5,-0.022],[37.5,14.705],[73.5,14.705],[73.5,-0.022]],"c":true}]}],"ix":1},"o":{"a":0,"k":100,"ix":3},"x":{"a":0,"k":0,"ix":4},"nm":"Маска 1"}],"shapes":[{"ty":"gr","it":[{"ind":0,"ty":"sh","ix":1,"ks":{"a":0,"k":{"i":[[0,0],[0.391,0.391],[0,0],[0.391,-0.391],[-0.391,-0.391],[0,0],[0,0],[-0.391,-0.391],[-0.391,0.391]],"o":[[0.391,-0.391],[0,0],[-0.391,-0.391],[-0.391,0.391],[0,0],[0,0],[-0.391,0.391],[0.391,0.391],[0,0]],"v":[[17.658,0.707],[17.658,-0.707],[11.294,-7.071],[9.88,-7.071],[9.88,-5.657],[15.537,0],[9.88,5.657],[9.88,7.071],[11.294,7.071]],"c":true},"ix":2},"nm":"Контур 1","mn":"ADBE Vector Shape - Group","hd":false},{"ind":1,"ty":"sh","ix":2,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0]],"v":[[-18.049,1],[16.951,1],[16.951,-1],[-18.049,-1]],"c":true},"ix":2},"nm":"Контур 3","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"fl","c":{"a":0,"k":[0.2,0.2,0.2,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ind":3,"ty":"sh","ix":4,"ks":{"a":0,"k":{"i":[[0,0],[0,0],[0,0],[0,0]],"o":[[0,0],[0,0],[0,0],[0,0]],"v":[[-18.049,1],[16.951,1],[16.951,-1],[-18.049,-1]],"c":true},"ix":2},"nm":"Контур 2","mn":"ADBE Vector Shape - Group","hd":false},{"ty":"tr","p":{"a":0,"k":[18.049,7.364],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"Группа 1","np":4,"cix":2,"bm":0,"ix":1,"mn":"ADBE Vector Group","hd":false},{"ty":"tm","s":{"a":0,"k":0,"ix":1},"e":{"a":0,"k":100,"ix":2},"o":{"a":0,"k":0,"ix":3},"m":1,"ix":2,"nm":"Обрезать контуры 1","mn":"ADBE Vector Filter - Trim","hd":false}],"ip":0,"op":180.00000733155,"st":0,"bm":0},{"ddd":0,"ind":6,"ty":4,"nm":"Слой-фигура 1","sr":1,"ks":{"o":{"a":0,"k":100,"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[197,32,0],"ix":2},"a":{"a":0,"k":[-641.75,-89.25,0],"ix":1},"s":{"a":0,"k":[102.218,106.299,100],"ix":6}},"ao":0,"shapes":[{"ty":"gr","it":[{"ty":"rc","d":1,"s":{"a":0,"k":[394.5,63.5],"ix":2},"p":{"a":0,"k":[0,0],"ix":3},"r":{"a":0,"k":0,"ix":4},"nm":"Контур прямоугольника 1","mn":"ADBE Vector Shape - Rect","hd":false},{"ty":"st","c":{"a":0,"k":[1,1,1,1],"ix":3},"o":{"a":0,"k":100,"ix":4},"w":{"a":0,"k":0,"ix":5},"lc":1,"lj":1,"ml":4,"bm":0,"nm":"Обводка 1","mn":"ADBE Vector Graphic - Stroke","hd":false},{"ty":"fl","c":{"a":0,"k":[1,0.819607843137,0.266666666667,1],"ix":4},"o":{"a":0,"k":100,"ix":5},"r":1,"bm":0,"nm":"Заливка 1","mn":"ADBE Vector Graphic - Fill","hd":false},{"ty":"tr","p":{"a":0,"k":[-641.75,-89.25],"ix":2},"a":{"a":0,"k":[0,0],"ix":1},"s":{"a":0,"k":[100,100],"ix":3},"r":{"a":0,"k":0,"ix":6},"o":{"a":0,"k":100,"ix":7},"sk":{"a":0,"k":0,"ix":4},"sa":{"a":0,"k":0,"ix":5},"nm":"Преобразовать"}],"nm":"Прямоугольник 1","np":3,"cix":2,"bm":0,"ix":1,"mn":"ADBE Vector Group","hd":false}],"ip":0,"op":180.00000733155,"st":0,"bm":0}],"markers":[]};
        const params = {
            container: $addToCartButton.get()[0],
            renderer: 'svg',
            loop: false,
            autoplay: true,
            animationData: animationData
        };
        const types = {still: 'still', hover: 'hover', click: 'click', loaded: 'loaded'};
        let type = types.still;
        const anim = lottie.loadAnimation(params);
        anim.setSubframe(false);
        anim.goToAndStop(30, true);
        const onEnterFrameHandler = (e) => {
            const frame = e.currentTime;
            switch (type) {
                case types.hover: {
                    if (frame === 60) {
                        anim.pause();
                    }
                    break;
                }
                case types.still: {
                    if (frame === 30) {
                        anim.pause();
                    }
                    break;
                }
                case types.click: {
                    if (frame === 138) {
                        anim.goToAndPlay(90, true)
                    }
                }
            }
        };
        anim.addEventListener('enterFrame', onEnterFrameHandler);

        const onMouseEnterHandler = () => {
            if (type === types.still) {
                type = types.hover;
                anim.setDirection(1);
                anim.play();
            }
        };
        const onMouseLeaveHandler = () => {
            if (type === types.hover) {
                type = types.still;
                anim.setDirection(-1);
                anim.play();
            }
        };
        const onClickHandler = () => {
            Cart.add(cartQuery.get());
            type = types.loaded;
            anim.setDirection(1);
            anim.play();
        };


        $addToCartButton.on('mouseenter', onMouseEnterHandler).on('mouseleave', onMouseLeaveHandler).on('click', onClickHandler);
    })();

    //init
    (()=>{
        selectors.material.selectSelected();
        selectors.model.selectSelected();
        selectors.glass.selectSelected();
    })();
});
